---
kind: method
id: M:Autodesk.Revit.DB.Lighting.HemisphericalLightDistribution.#ctor(Autodesk.Revit.DB.Lighting.HemisphericalLightDistribution)
source: html/643ba7bc-32ca-265b-4673-fd5f094083f7.htm
---
# Autodesk.Revit.DB.Lighting.HemisphericalLightDistribution.#ctor Method

Creates a copy of the given hemispherical light distribution

## Syntax (C#)
```csharp
public HemisphericalLightDistribution(
	HemisphericalLightDistribution other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Lighting.HemisphericalLightDistribution`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null